<?php
session_start();
require("../../main_config.php");
require($s_v_app_root."task_core.php");
$cls_Task = new cls_Task();
//-------------------------------------------------->
$cls_Task->s_title = "Змінні";
$cls_Task->s_id = "";//Порожнє значення для теорії
$cls_Task->s_description = "";

$cls_Task->_add_step("<p class='container theory'>В математиці ми звикли до того, що значенням змінної завжди є деяке число: ціле, дробове, від’ємне чи додатне. Під час написання програм часто потрібно обробляти не лише числові дані, а й інші, наприклад, текстові. Скажімо, програма для продажу квитків на потяг повинна працювати з числовими величинами: вартістю квитка, часом відправлення, номером потягу, вагону, місця. Але, разом з тим, потрібно опрацьовувати і текстові величини: місце відправлення, призначення. Отже, в програмуванні, поруч із звичними виразами x = 5 або y = 7,2 існують вирази a = ”Житомир” або b = ”Львів”.</p>

<p class='container' >Числові величини, на відміну від текстових, можна віднімати, множити чи ділити. В свою чергу, в текстових величинах можна здійснювати пошук чи заміну символів.</p>

<p class='container' ><b>Змінна</b> — це величина, значення якої може змінюватися в процесі виконання програми. 

<p class='container' >В мові програмування C# існує поняття типу змінної. Тип змінної вказує:</p>
<p class='container' >▶️ які значення в неї можна записувати<br>
▶️ які операції над нею можна виконувати</p>
");

$cls_Task->_add_step("<p class='container'><b>Таблиця типів змінних:</b></p>");
$cls_Task->_add_step("<div class='container'>
<table class='table table-striped table-bordered'>
    <tbody><tr align='center'>
        <th width='150'>Тип C#</th>
        <th width='220'>Опис</th>
        <th width='420'>Діапазон значень</th>
        <th width='*'>Обсяг оперативної пам’яті, байт</th>
    </tr>
    <tr>
        <td>sbyte</td>
        <td>Ціле знакове число</td>
        <td>-128...127</td>
        <td>1</td>
    </tr>
    <tr style='background: #dfedeb;'>
        <td>byte</td>
        <td>Ціле беззнакове число</td>
        <td>0...255</td>
        <td>1</td>
    </tr>
    <tr>
        <td>short</td>
        <td>Ціле знакове число</td>
        <td>-32768...32767 </td>
        <td>2</td>
    </tr>
    <tr>
        <td>ushort</td>
        <td>Ціле беззнакове число</td>
        <td>0...65535 </td>
        <td>2</td>
    </tr>
    <tr style='background: #dfedeb;'>
        <td>int</td>
        <td>Ціле знакове число</td>
        <td>-2147483648... 2147483647 </td>
        <td>4</td>
    </tr>
    <tr>
        <td>uint</td>
        <td>Ціле беззнакове число</td>
        <td>0...4294967295</td>
        <td>4</td>
    </tr>
    <tr style='background: #dfedeb;'>
        <td>long</td>
        <td>Ціле знакове число</td>
        <td>-9223372036854775808...9223372036854775807</td>
        <td>8</td>
    </tr>
    <tr>
        <td>ulong</td>
        <td>Ціле беззнакове число</td>
        <td>0...18446744073709551615</td>
        <td>8</td>
    </tr>
    <tr>
        <td>float</td>
        <td>Дробове число</td>
        <td>точність до 7 знаків</td>
        <td>4</td>
    </tr>
    <tr style='background: #dfedeb;'>
        <td>double</td>
        <td>Дробове число</td>
        <td>точність до 16 знаків</td>
        <td>8</td>
    </tr>
    <tr>
        <td>decimal</td>
        <td>Дробове число</td>
        <td>точність до 28 знаків</td>
        <td>16</td>
    </tr>
    <tr>
        <td>bool</td>
        <td>Логічний (булевський) тип</td>
        <td>false, true</td>
        <td>1</td>
    </tr>
    <tr>
        <td>char</td>
        <td>Символ Unicode</td>
        <td>один символ Unicode</td>
        <td>2</td>
    </tr>
    <tr>
        <td>string</td>
        <td>Рядок символів Unicode</td>
        <td></td>
        <td></td>
    </tr>
</tbody></table>
</div>");


$cls_Task->_add_step("<p class='container'>Надалі домовимося для числових величин використовувати такі типи: byte, int і long – якщо числа цілі; double – якщо дробові.</p>");
$cls_Task->_add_step("<p class='container'>Як видно з таблиці, різні типи змінних займають різні обсяги оперативної пам’яті.</p>");
$cls_Task->_add_step("<p class='container'>🧾 Розглянемо такий приклад: в задачі відомо бали випускника з трьох предметів ЗНО. Програма повинна знаходити суму всіх балів. Як відомо, максимальний бал за ЗНО дорівнює 200, а, отже, для трьох змінних доцільно обрати тип byte. Проте, для змінної, яка позначає суму набраних балів тип byte не підходить — сума балів в задачі може бути рівною 600, а, отже, знадобиться тип int. Програма буде правильно працювати і у випадку, якщо для всіх чотирьох змінних обрати тип int, але буде вимагати більше оперативної пам’яті для свого виконання. Порівняємо перший і другий варіанти вибору типів змінних для даної задачі. Перший варіант: 3 змінних х 1 байт + 1 змінна * 4 байти = 7 байт; другий варіант: 4 змінних х 4 байт = 16 байт. Нераціональне використання типів змінних, особливо в великих проектах, призводить до невиправдано великих вимог програм до оперативної пам’яті комп’ютера.</p>");

$cls_Task->_add_step("<p class='container'><b>Імена змінних</b></p>");
$cls_Task->_add_step("<p class='container'>В математиці ми звикли позначати змінні однією латинською літерою, наприклад: x, y, a, b, c. При написанні великих програм може знадобитися значна кількість змінних, і, позначаючи їх одною літерою, буде важко пам’ятати, що позначає та чи інша змінна. Тому в програмуванні прийнято називати змінні словами або навіть словосполученнями, що полегшує розуміння програмного коду. Наприклад, якщо в задачі потрібно визначити швидкість руху велосипеда та автомобіля, то доречно буде дати змінним імена SpeedBike та SpeedCar відповідно.</p>");
$cls_Task->_add_step("<p class='container'>При виборі імен для змінних потрібно дотримуватися вимог мови С#:<br>

✅ можна використовувати англійські літери, цифри та знак “_”<br>
❌ ім’я не може починатися з цифри<br>
🈂️ мова C# чутлива до регістру (наприклад, змінні sidea та sideA – це дві різні змінні).</p>");

$cls_Task->_add_step("<p class='container'><b>Арифметичні операції</b></p>");
$cls_Task->_add_step("<div class='container'>
<table class='table table-striped table-bordered'>
    <tbody><tr align='center'>
        <th width='120'>Оператор</th>
        <th width='400'>Опис</th>
        <th width='*'>Приклади</th>
    </tr>
    <tr>
        <td>+</td>
        <td>Додавання</td>
        <td>2 + 3 = 5; <br>
        3.6 + 7.3 = 10.9</td>
    </tr>
    <tr>
        <td>-</td>
        <td>Віднімання</td>
        <td>7 - 9 = -1; <br>
        6 - 1.25 = 4.75</td>
    </tr>
    <tr>
        <td>*</td>
        <td>Множення</td>
        <td>7 * 2 = 14; <strike>2а</strike></td>
    </tr>
    <tr>
        <td>/</td>
        <td>Ділення</td>
        <td>5 / 2 = 2; 15 / 4 = 3<br>5.0 / 2 = 2.5; <br>15 / 4.0 = 3.75</td>
    </tr>
    <tr>
        <td>%</td>
        <td>Остача від ділення</td>
        <td>5 % 2 = 1; <br>27 % 4 = 3; <br>8 % 4 = 0</td>
    </tr>
    <tr>
        <td>++</td>
        <td>Інкремент (збільшення значення змінної на 1)</td>
        <td>x++</td>
    </tr>
    <tr>
        <td>--</td>
        <td>Декремент (зменшення значення змінної на 1)</td>
        <td>a--</td>
    </tr>
</tbody></table>

</div>");
$cls_Task->_add_step("<p class='container'><b>Примітка 1</b> Якщо ділене і дільник є цілими числами, то результатом операції ділення буде лише ціла частина частки.<br>

<b>Примітка 2</b>. Знак множення ставиться обов’язково.</p>");

$cls_Task->_add_step("<p class='container'><b>Оголошення змінної. Ініціалізація змінної. Оператор присвоювання</b></p>");
$cls_Task->_add_step("<p class='container'>
Перед першим використанням змінну потрібно оголосити — вказати її ім’я та тип, до якого вона належить. Спроба використати змінну, яка не була оголошена, призведе до помилки компіляції.

<b><i>Приклади оголошення змінних:</b></i><br>

<pre >
    <code class='cs hljs'>
        byte a; <br>
        int s, t; <br>
        double v; <br>
    </code>
</pre>		

Надання змінній початкового значення називається ініціалізацією. Оголошення змінної та її ініціалізацію можна об’єднувати в один запис, наприклад: <br>

<pre >
    <code class='cs hljs'>
        byte a = 7; <br>
        int s = 130, t = 2; <br>
    </code>	
</pre >	

Знак “=” в мові C# називають оператором присвоювання. В загальному, операція присвоювання має такий вигляд: <br>

<pre >
    <code class='cs hljs'>
        ім’я змінної = значення або вираз; <br>
    </code>	
</pre >

Якщо справа від знаку “=” записано вираз, то він спочатку обчислюється, а потім результат присвоюється змінній, ім’я якої записано ліворуч.
</p>");


$cls_Task->_add_step("<p class='container'><b></b></p>");
$cls_Task->_add_step("<p class='container'></p>");

$cls_Task->s_learn_url = "";
$cls_Task->s_youtube_url = "";
$cls_Task->s_discuss_url = "";
//-------------------------------------------------->
//run:
include($s_v_app_root."t_task.php");
?>